//API6C    JOB (ACCT#),'JUL',MSGCLASS=H,REGION=4M,
//    CLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID,
//    COND=(4,LT)
//*
//* ETAPE DE COMPILATION DU PROGRAMME COBOL
//*
//COMPIL EXEC IGYWCL,PARM.COBOL=(ADV,OBJECT,LIB,TEST,APOST)
//COBOL.SYSIN  DD DSN=API6.COB.PROJET(DATETXT),DISP=SHR
//*  DDNP         DD DSN=API6.PROJET.NEWPRODS.DATA,DISP=SHR
//DDDEV        DD DSN=API6.VSAM.DEVISE.DATA,DISP=SHR
//COBOL.SYSLIB DD DSN=CEE.SCEESAMP,DISP=SHR
//             DD DSN=API6.COB.CPY,DISP=SHR
//*
//* ETAPE DE LIKEDIT
//*
//LKED.SYSLMOD DD DSN=API6.COB.LOAD,DISP=(SHR,KEEP,KEEP)
//LKED.SYSIN DD *
 NAME DATETXT(R)
/*
