//API6C JOB (ACCT#),'JUL',MSGCLASS=H,REGION=4M,
//    CLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID,
//    COND=(4,LT)
//*--------------------------------------------------------------------*
//* COMPILATION DU MODULE SCONVDEV (100% BATCH)
//*--------------------------------------------------------------------*
//COMPIL EXEC IGYWCL,PARM.COBOL=(DYNAM,ADV,OBJECT,LIB,TEST,APOST)
//COBOL.SYSIN  DD DSN=API6.COB.PROJET(SCONVDEV),DISP=SHR
//COBOL.SYSLIB DD DSN=CEE.SCEESAMP,DISP=SHR
//             DD DSN=API6.COB.CPY,DISP=SHR
//LKED.SYSLMOD DD DSN=API6.COB.LOAD(SCONVDEV),DISP=(SHR,KEEP,KEEP)
//LKED.SYSIN  DD *
   NAME SCONVDEV(R)
/*

